export const theaterList = {
  서울: [
    'CGV 강남',
    'CGV 홍대',
    '롯데시네마 건대입구',
    '메가박스 코엑스',
    '메가박스 성수',
  ],
  경기: [
    'CGV 수원',
    'CGV 일산',
    '롯데시네마 분당',
    '메가박스 고양스타필드',
  ],
  인천: [
    'CGV 인천터미널',
    '롯데시네마 인천청라',
    '메가박스 송도',
  ],
  부산: [
    'CGV 서면',
    'CGV 해운대',
    '롯데시네마 부산본점',
    '메가박스 센텀시티',
  ],
  대구: [
    'CGV 대구아카데미',
    '롯데시네마 동성로',
    '메가박스 대구',
  ],
  대전: [
    'CGV 대전터미널',
    '롯데시네마 대전둔산',
    '메가박스 대전',
  ],
  광주: [
    'CGV 광주상무',
    '롯데시네마 광주수완',
    '메가박스 광주충장로',
  ],
};